{"keras_version": "2.1.4", "config": [{"config": {"activation": "relu", "batch_input_shape": [null, 28, 28, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "bias_regularizer": null, "trainable": true, "name": "conv2d_3", "kernel_constraint": null, "padding": "valid", "dtype": "float32", "data_format": "channels_last", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_4", "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_2", "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "name": "dropout_3", "noise_shape": null, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"name": "flatten_2", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "dense_3", "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "units": 128, "trainable": true}, "class_name": "Dense"}, {"config": {"rate": 0.5, "name": "dropout_4", "noise_shape": null, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"activation": "softmax", "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "dense_4", "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "units": 10, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "cntk"}